app/controllers/members_controller.rb

  def show
    @member = Member.find(params[:id])
---
SELECT * FROM "members" WHERE ("members"."id" = 1)

  def edit
    @member = Member.find(params[:id])
---
SELECT * FROM "members" WHERE ("members"."id" = 1)

  def create
    @members = Member.new(params[:members])

    respond_to do |format|
      if @members.save
---
INSERT INTO "members" ("name", "created_at", "notes", "updated_at", "team_id", "email") VALUES(NULL, '2010-11-19 10:01:43', NULL, '2010-11-19 10:01:43', NULL, NULL)

  def update
    @members = Member.find(params[:id])

    respond_to do |format|
      if @members.update_attributes(params[:members])
---
SELECT * FROM "members" WHERE ("members"."id" = 1)
UPDATE "members" SET "updated_at" = '2010-11-19 10:10:38', "email" = 'fake@gmail.com', "name" = 'John Doe', "notes" = 'John Doe is an awesome Programmer!', "team_id" = 1 WHERE "id" = 1