app/controllers/problem_sets_controller.rb

SELECT * FROM "problem_sets" WHERE ("problem_sets"."id" = 1)
---
  def show
    @problem_set = ProblemSet.find(params[:id])

SELECT * FROM "problem_sets" WHERE ("problem_sets"."id" = 1)
---
  def edit
    @problem_set = ProblemSet.find(params[:id])

INSERT INTO "problem_sets" ("name", "created_at", "updated_at") VALUES('Pacific Northwest 2009 (Star Wars)', '2010-11-19 09:43:17', '2010-11-19 09:43:17')
---
  def create
    @problem_set = ProblemSet.new(params[:problem_set])

    respond_to do |format|
      if @problem_set.save

SELECT * FROM "problem_sets" WHERE ("problem_sets"."id" = 1)
---
  def update
    @problem_set = ProblemSet.find(params[:id])