app/controllers/problems_controller.rb

SELECT * FROM "problems" WHERE ("problems"."id" = 1)
---
  def show
    @problems = Problems.find(params[:id])

SELECT * FROM "problems" WHERE ("problems"."id" = 1)
---
  def edit
    @problems = Problems.find(params[:id])

INSERT INTO "problems" ("name", "created_at", "problem_set_id", "updated_at", "description") VALUES('A: Navicomputer', '2010-11-19 09:52:02', 1, '2010-11-19 09:52:02', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Donec egestas mauris sed libero venenatis non iaculis lacus sodales. Cras turpis magna, congue eu aliquet vel, interdum in libero. Maecenas iaculis mollis dui, sed pulvinar mi accumsan in. Aenean rhoncus aliquam consequat. Ut et felis neque, quis congue lorem. In hac habitasse platea dictumst. In non sapien orci, nec rutrum dolor. Aenean tortor tortor, egestas non laoreet sit amet, malesuada lobortis nibh. Morbi in sapien eu risus placerat vehicula. Donec faucibus turpis ut ligula convallis adipiscing. Suspendisse magna libero, sagittis eu dapibus a, congue non leo. Proin bibendum euismod facilisis. Sed suscipit ligula vel dui vestibulum ac sollicitudin nunc scelerisque. Morbi diam sem, volutpat ac molestie id, tempor quis dolor. Nullam at tortor tellus, non auctor tortor.')
---
  def create
    @problems = Problems.new(params[:problems])

    respond_to do |format|
      if @problems.save