app/controllers/teams_controller.rb

  def show
    @team = Team.find(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 1)

  def edit
    @team = Team.find(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 1)

  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES('NerfHerders', '2010-11-19 09:31:09', '2010-11-19 09:31:09')